// Задание №8. Создайте массив с элементами 'a', 'b', 'c'. Запишите 
// вместо первого элемента слово, вместо второго - предложение, вместо 
// третьего - новую букву. Массив должен состоять только из строк. 
// Выведите итоговый массив в документ или в консоль.

// Создаем массив с элементами 'a', 'b', 'c'
let myArray = ['a', 'b', 'c'];

// Записываем вместо первого элемента слово
myArray[0] = 'слово';

// Записываем вместо второго - предложение
myArray[1] = 'Это предложение.';

// Записываем вместо третьего - новую букву
myArray[2] = 'z';

// Выводим в консоль итоговый массив
console.log("Итоговый массив:", myArray);
