
// 10. Вывести на экран последнюю цифру целого числа введенного с клавиатуры. 

int a;
a=Convert.ToInt32(Console.ReadLine());
a=a%10;
System.Console.WriteLine(a);
