// // Ввести n 0 до 10 с проверкой ввода

// // До тех пор пока
// {
// int n; 
// do
// {
//     n=Convert.ToInt32(Console.ReadLine());
// }
// while(n<0 || n>0); // циклм с условием
// }

// Цикл для

// Вывести на экран числа от 1 до 10
//int i=1;
// while (i<=10);
// {
//     System.Console.WriteLine(i);
//     i+1=1
//     i++;
// }
// for(int i=1;i<=10;i++)
// {
//     System.Console.WriteLine(i);
// }

// string s="ABCDED";
// foreach(char c in s) //работает с коллекциями(оеализующими интерфейс IEnumerabke)
// {
//     System.Console.WriteLine(c);
// }

